----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 448, 256]           1,792
              ReLU-2         [-1, 64, 448, 256]               0
          one_conv-3         [-1, 64, 448, 256]               0
            inconv-4         [-1, 64, 448, 256]               0
         MaxPool2d-5         [-1, 64, 224, 128]               0
            Conv2d-6        [-1, 128, 224, 128]          73,856
              ReLU-7        [-1, 128, 224, 128]               0
          one_conv-8        [-1, 128, 224, 128]               0
              down-9        [-1, 128, 224, 128]               0
        MaxPool2d-10         [-1, 128, 112, 64]               0
           Conv2d-11         [-1, 256, 112, 64]         295,168
             ReLU-12         [-1, 256, 112, 64]               0
         one_conv-13         [-1, 256, 112, 64]               0
             down-14         [-1, 256, 112, 64]               0
        MaxPool2d-15          [-1, 256, 56, 32]               0
           Conv2d-16          [-1, 512, 56, 32]       1,180,160
             ReLU-17          [-1, 512, 56, 32]               0
         one_conv-18          [-1, 512, 56, 32]               0
             down-19          [-1, 512, 56, 32]               0
        MaxPool2d-20          [-1, 512, 28, 16]               0
           Conv2d-21          [-1, 512, 28, 16]       2,359,808
             ReLU-22          [-1, 512, 28, 16]               0
         one_conv-23          [-1, 512, 28, 16]               0
             down-24          [-1, 512, 28, 16]               0
  ConvTranspose2d-25          [-1, 512, 56, 32]       1,049,088
           Conv2d-26          [-1, 256, 56, 32]       2,359,552
             ReLU-27          [-1, 256, 56, 32]               0
         one_conv-28          [-1, 256, 56, 32]               0
               up-29          [-1, 256, 56, 32]               0
  ConvTranspose2d-30         [-1, 256, 112, 64]         262,400
           Conv2d-31         [-1, 128, 112, 64]         589,952
             ReLU-32         [-1, 128, 112, 64]               0
         one_conv-33         [-1, 128, 112, 64]               0
               up-34         [-1, 128, 112, 64]               0
  ConvTranspose2d-35        [-1, 128, 224, 128]          65,664
           Conv2d-36         [-1, 64, 224, 128]         147,520
             ReLU-37         [-1, 64, 224, 128]               0
         one_conv-38         [-1, 64, 224, 128]               0
               up-39         [-1, 64, 224, 128]               0
  ConvTranspose2d-40         [-1, 64, 448, 256]          16,448
           Conv2d-41         [-1, 32, 448, 256]          36,896
             ReLU-42         [-1, 32, 448, 256]               0
         one_conv-43         [-1, 32, 448, 256]               0
               up-44         [-1, 32, 448, 256]               0
           Conv2d-45          [-1, 3, 448, 256]              99
          outconv-46          [-1, 3, 448, 256]               0
================================================================
Total params: 8,438,403
Trainable params: 8,438,403
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 1.31
Forward/backward pass size (MB): 773.50
Params size (MB): 32.19
Estimated Total Size (MB): 807.00
----------------------------------------------------------------
None
